app/Controllers/Auth.php

	public function create()
	{

		$this->headersConfig();

		/**
		 * JWT claim types
		 * https://auth0.com/docs/tokens/concepts/jwt-claims#reserved-claims
		 */

		$email = $this->request->getPost('email');
		$password = md5($this->request->getPost('password')==null?"":$this->request->getPost('password'));

		$db      = \Config\Database::connect();
        $builder = $db->table('users');
        $builder->select('*');
		$builder->where("us_email", $email);
		$builder->where("us_password", $password);
        $query = $builder->get();
---
SELECT *
FROM `users`
WHERE `us_email` = 'roman@gmail.com'
AND `us_password` = '202cb962ac59075b964b07152d234b70'