app/Controllers/Home.php

    public function getRecipes($id){
        $db      = \Config\Database::connect();
        $builder = $db->table('recetas r');
        $builder->select('p.pr_name, i.in_name, r.re_quantity, i.in_unity, i.in_price, i.in_quantity');
        $builder->join('insumos i', "r.re_supply = i.in_id");
        $builder->join('productos p', "r.re_product = p.pr_id");
        $builder->where('p.pr_id', $id);
        $query = $builder->get();
---
SELECT *
FROM `productos`