app/Controllers/RecipeController.php

    public function recipeList(){
        $this->headersConfig();
        $id_product = $this->request->getVar('id-product');
        $db      = \Config\Database::connect();
        $builder = $db->table('recetas r');
        $builder->select('r.re_id, r.re_product, r.re_supply, r.re_quantity, i.in_name, i.in_unity, i.in_quantity, i.in_price');
        $builder->join('insumos i', "r.re_supply = i.in_id");
        $builder->join('productos p', "r.re_product = p.pr_id");
        $builder->where('p.pr_id', $id_product);

        $query = $builder->get();
---
SELECT `r`.`re_id`, `r`.`re_product`, `r`.`re_supply`, `r`.`re_quantity`, `i`.`in_name`, `i`.`in_unity`, `i`.`in_quantity`, `i`.`in_price`
FROM `recetas` `r`
JOIN `insumos` `i` ON `r`.`re_supply` = `i`.`in_id`
JOIN `productos` `p` ON `r`.`re_product` = `p`.`pr_id`
WHERE `p`.`pr_id` = '1'